#pragma once
#include <SFML/Graphics.hpp>
#include "Block.h"
#include "Tab.h"
#include <list>

const int HEIGHT_MAP = 10;
const int WIDTH_MAP = 7;
const int AOE = 4; //Amount of Enemies - кол-во врагов
const int AOB = 5; //Amount of Bonus - кол-во бонусов
//Block** arr; убрано в Game.h

sf::String TileMap[HEIGHT_MAP] = {
	"0000000",
	"0     0",
	"0  0  0",
	"0     0",
	"0R 0  0",
	"0  0  0",
	"0     0",
	"0 00  0",
	"0    R0",
	"0000000",

};

//sf::String TileMap[HEIGHT_MAP] = {
//	"0000000",
//	"0 l2220",
//	"0ll0ll0",
//	"0222220",
//	"0R20ll0",
//	"0ll0220",
//	"0222220",
//	"0222220",
//	"02222l0",
//	"0000000",
//
//};


//sf::String TileMap[HEIGHT_MAP] = {
//	"0000000",
//	"0 l   0",
//	"0ll0ll0",
//	"0     0",
//	"0R 0ll0",
//	"0ll0  0",
//	"0l    0",
//	"0 00  0",
//	"0    l0",
//	"0000000",
//
//};


//sf::String TileMap[HEIGHT_MAP] = {
//	"00000000000000000",
//	"0     RR        0",
//	"0               0", //0 по аски = 48. пробел = 32
//	"0 RR            0",
//	"0               0",
//	"0               0",
//	"0               0",
//	"0               0",
//	"0               0",
//	"00000000000000000",
//
//};


//sf::String TileMap[HEIGHT_MAP] = { //25 и 40
//	"0000000000000000000000000000000000000000",
//	"0  0    l                              0",
//	"0  l    000                            0",
//	"0lll    0w0                            0",
//	"0 b     000                            0",
//	"0ww  wlll                              0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0                                      0",
//	"0000000000000000000000000000000000000000",
//};
